{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "input_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_43/conv2d_30/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_43/conv2d_30/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_44/conv2d_31/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_44/conv2d_31/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_45/conv2d_32/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_45/conv2d_32/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_46/conv2d_33/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_46/conv2d_33/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_47/conv2d_34/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_47/conv2d_34/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_48/conv2d_35/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_48/conv2d_35/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_56/conv2d_transpose_25/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_56/conv2d_transpose_25/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_49/conv2d_36/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_42/conv2d_29/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/conv2d_transpose_26/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_56/batch_normalization_50/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_56/batch_normalization_50/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/batch_normalization_49/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/batch_normalization_49/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_42/conv2d_29/Conv2D", "op": "Conv2D", "input": ["input_3", "StatefulPartitionedCall/model_4/sequential_42/conv2d_29/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_42/leaky_re_lu_27/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_42/conv2d_29/Conv2D"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_43/batch_normalization_38/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/sequential_42/leaky_re_lu_27/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_43/conv2d_30/Conv2D_weights", "StatefulPartitionedCall/model_4/sequential_43/conv2d_30/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_43/leaky_re_lu_28/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_43/batch_normalization_38/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_4/sequential_44/batch_normalization_39/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/sequential_43/leaky_re_lu_28/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_44/conv2d_31/Conv2D_weights", "StatefulPartitionedCall/model_4/sequential_44/conv2d_31/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_44/leaky_re_lu_29/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_44/batch_normalization_39/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_4/sequential_45/batch_normalization_40/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/sequential_44/leaky_re_lu_29/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_45/conv2d_32/Conv2D_weights", "StatefulPartitionedCall/model_4/sequential_45/conv2d_32/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_45/leaky_re_lu_30/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_45/batch_normalization_40/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_4/sequential_46/batch_normalization_41/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/sequential_45/leaky_re_lu_30/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_46/conv2d_33/Conv2D_weights", "StatefulPartitionedCall/model_4/sequential_46/conv2d_33/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_46/leaky_re_lu_31/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_46/batch_normalization_41/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_47/batch_normalization_42/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/sequential_46/leaky_re_lu_31/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_47/conv2d_34/Conv2D_weights", "StatefulPartitionedCall/model_4/sequential_47/conv2d_34/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_47/leaky_re_lu_32/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_47/batch_normalization_42/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_4/sequential_48/batch_normalization_43/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_4/sequential_47/leaky_re_lu_32/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_48/conv2d_35/Conv2D_weights", "StatefulPartitionedCall/model_4/sequential_48/conv2d_35/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_4/sequential_48/leaky_re_lu_33/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_48/batch_normalization_43/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_49/conv2d_36/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_4/sequential_48/leaky_re_lu_33/LeakyRelu", "StatefulPartitionedCall/model_4/sequential_49/conv2d_36/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/sequential_49/leaky_re_lu_34/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_4/sequential_49/conv2d_36/Conv2D"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/sequential_49/leaky_re_lu_34/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/strided_slice", "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/mul", "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/mul_1", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/stack", "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_4/sequential_49/leaky_re_lu_34/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_4/sequential_50/conv2d_transpose_19/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_50/re_lu_17/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/sequential_50/batch_normalization_44/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/concatenate_16/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/sequential_50/re_lu_17/Relu", "StatefulPartitionedCall/model_4/sequential_48/leaky_re_lu_33/LeakyRelu", "StatefulPartitionedCall/model_4/conv2d_transpose_26/stack/3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/concatenate_16/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/strided_slice", "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/mul", "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/mul_1", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/stack", "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_4/concatenate_16/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_4/sequential_51/conv2d_transpose_20/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_51/re_lu_18/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/sequential_51/batch_normalization_45/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/concatenate_17/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/sequential_51/re_lu_18/Relu", "StatefulPartitionedCall/model_4/sequential_47/leaky_re_lu_32/LeakyRelu", "StatefulPartitionedCall/model_4/conv2d_transpose_26/stack/3"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/concatenate_17/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/strided_slice", "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/mul", "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/mul_1", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/stack", "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_4/concatenate_17/concat"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_4/sequential_52/conv2d_transpose_21/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_52/re_lu_19/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/sequential_52/batch_normalization_46/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/concatenate_18/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/sequential_52/re_lu_19/Relu", "StatefulPartitionedCall/model_4/sequential_46/leaky_re_lu_31/LeakyRelu", "StatefulPartitionedCall/model_4/conv2d_transpose_26/stack/3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/concatenate_18/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/strided_slice", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/mul", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/mul_1", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/stack", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_4/concatenate_18/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_4/sequential_53/conv2d_transpose_22/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_53/re_lu_20/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/sequential_53/batch_normalization_47/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/concatenate_19/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/sequential_53/re_lu_20/Relu", "StatefulPartitionedCall/model_4/sequential_45/leaky_re_lu_30/LeakyRelu", "StatefulPartitionedCall/model_4/conv2d_transpose_26/stack/3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/concatenate_19/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/strided_slice", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/mul", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/mul_1", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/stack", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_4/concatenate_19/concat"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_4/sequential_54/conv2d_transpose_23/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_54/re_lu_21/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/sequential_54/batch_normalization_48/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/concatenate_20/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/sequential_54/re_lu_21/Relu", "StatefulPartitionedCall/model_4/sequential_44/leaky_re_lu_29/LeakyRelu", "StatefulPartitionedCall/model_4/conv2d_transpose_26/stack/3"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/concatenate_20/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/Shape", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_1/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice_2/stack_1", "StatefulPartitionedCall/model_4/conv2d_transpose_26/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/conv2d_transpose_26/mul/y", "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/strided_slice", "StatefulPartitionedCall/model_4/sequential_55/conv2d_transpose_24/mul", 