{
  "format": "graph-model",
  "generatedBy": "2.1.0",
  "convertedBy": "TensorFlow.js Converter v1.7.2",
  "userDefinedMetadata": {
    "signature": {
      "inputs": {
        "input_2:0": {
          "name": "input_2:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "256"
            }, {
              "size": "256"
            }, {
              "size": "3"
            }]
          }
        }
      },
      "outputs": {
        "Identity:0": {
          "name": "Identity:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "256"
            }, {
              "size": "256"
            }, {
              "size": "3"
            }]
          }
        }
      }
    }
  },
  "modelTopology": {
    "node": [{
      "name": "input_2",
      "op": "Placeholder",
      "attr": {
        "shape": {
          "shape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "256"
            }, {
              "size": "256"
            }, {
              "size": "3"
            }]
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_16/conv2d_9/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "32"
              }, {
                "size": "128"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_16/conv2d_9/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "128"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_17/conv2d_10/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "128"
              }, {
                "size": "256"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_17/conv2d_10/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "256"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_18/conv2d_11/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "256"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_18/conv2d_11/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_19/conv2d_12/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_19/conv2d_12/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_20/conv2d_13/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_20/conv2d_13/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_21/conv2d_14/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_21/conv2d_14/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_22/conv2d_15/Conv2D_weights",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_22/conv2d_15/Conv2D_bn_offset",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "3"
              }, {
                "size": "96"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_29/conv2d_transpose_14/stack/3",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_29/conv2d_transpose_14/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "64"
              }, {
                "size": "256"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_28/conv2d_transpose_13/stack/3",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_28/conv2d_transpose_13/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "128"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_27/conv2d_transpose_12/stack/3",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_27/conv2d_transpose_12/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "256"
              }, {
                "size": "1024"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_26/conv2d_transpose_11/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "1024"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_25/conv2d_transpose_10/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "1024"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "1024"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/mul/y",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_1/stack_1",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_2/stack_1",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_26/conv2d_transpose_11/stack/3",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "dtype": {
          "type": "DT_INT32"
        },
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/conv2d_transpose/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "512"
              }, {
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_15/conv2d_8/Conv2D/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }, {
                "size": "4"
              }, {
                "size": "3"
              }, {
                "size": "32"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/stack/3",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/conv2d_transpose_15/BiasAdd/ReadVariableOp",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_29/batch_normalization_27/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_29/batch_normalization_27/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_28/batch_normalization_26/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "128"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_28/batch_normalization_26/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "128"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_27/batch_normalization_25/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "256"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_27/batch_normalization_25/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "256"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_26/batch_normalization_24/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_26/batch_normalization_24/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_25/batch_normalization_23/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_25/batch_normalization_23/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3/Scaled",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3/Offset",
      "op": "Const",
      "input": ["^input_2"],
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "512"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_15/conv2d_8/Conv2D",
      "op": "Conv2D",
      "input": ["input_2", "StatefulPartitionedCall/model_1/sequential_15/conv2d_8/Conv2D/ReadVariableOp"],
      "device": "/device:CPU:0",
      "attr": {
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_15/leaky_re_lu_8/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_15/conv2d_8/Conv2D"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "alpha": {
          "f": 0.30000001192092896
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_16/batch_normalization_14/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_15/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_16/conv2d_9/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_16/conv2d_9/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "data_format": {
          "s": "TkhXQw=="
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "num_args": {
          "i": "1"
        },
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_16/leaky_re_lu_9/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_16/batch_normalization_14/FusedBatchNormV3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "alpha": {
          "f": 0.30000001192092896
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_17/batch_normalization_15/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_16/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_17/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_17/conv2d_10/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "num_args": {
          "i": "1"
        },
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_17/leaky_re_lu_10/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_17/batch_normalization_15/FusedBatchNormV3"],
      "attr": {
        "alpha": {
          "f": 0.30000001192092896
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_18/batch_normalization_16/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_17/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_18/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_18/conv2d_11/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "data_format": {
          "s": "TkhXQw=="
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "explicit_paddings": {
          "list": {}
        },
        "num_args": {
          "i": "1"
        },
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_18/leaky_re_lu_11/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_18/batch_normalization_16/FusedBatchNormV3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "alpha": {
          "f": 0.30000001192092896
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_19/batch_normalization_17/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_18/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_19/conv2d_12/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_19/conv2d_12/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "explicit_paddings": {
          "list": {}
        },
        "num_args": {
          "i": "1"
        },
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_19/leaky_re_lu_12/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_19/batch_normalization_17/FusedBatchNormV3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "alpha": {
          "f": 0.30000001192092896
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_20/batch_normalization_18/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_19/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_20/conv2d_13/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_20/conv2d_13/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "num_args": {
          "i": "1"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_20/leaky_re_lu_13/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_20/batch_normalization_18/FusedBatchNormV3"],
      "attr": {
        "alpha": {
          "f": 0.30000001192092896
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_21/batch_normalization_19/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_20/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_21/conv2d_14/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_21/conv2d_14/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "num_args": {
          "i": "1"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_21/leaky_re_lu_14/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_21/batch_normalization_19/FusedBatchNormV3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "alpha": {
          "f": 0.30000001192092896
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_22/batch_normalization_20/FusedBatchNormV3",
      "op": "_FusedConv2D",
      "input": ["StatefulPartitionedCall/model_1/sequential_21/leaky_re_lu_14/LeakyRelu", "StatefulPartitionedCall/model_1/sequential_22/conv2d_15/Conv2D_weights", "StatefulPartitionedCall/model_1/sequential_22/conv2d_15/Conv2D_bn_offset"],
      "device": "/device:CPU:0",
      "attr": {
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "explicit_paddings": {
          "list": {}
        },
        "num_args": {
          "i": "1"
        },
        "epsilon": {
          "f": 0.0
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "fused_ops": {
          "list": {
            "s": ["Qmlhc0FkZA=="]
          }
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_22/leaky_re_lu_15/LeakyRelu",
      "op": "LeakyRelu",
      "input": ["StatefulPartitionedCall/model_1/sequential_22/batch_normalization_20/FusedBatchNormV3"],
      "attr": {
        "alpha": {
          "f": 0.30000001192092896
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/Shape",
      "op": "Shape",
      "input": ["StatefulPartitionedCall/model_1/sequential_22/leaky_re_lu_15/LeakyRelu"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "out_type": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/strided_slice",
      "op": "StridedSlice",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1"],
      "attr": {
        "Index": {
          "type": "DT_INT32"
        },
        "T": {
          "type": "DT_INT32"
        },
        "shrink_axis_mask": {
          "i": "1"
        },
        "ellipsis_mask": {
          "i": "0"
        },
        "begin_mask": {
          "i": "0"
        },
        "new_axis_mask": {
          "i": "0"
        },
        "end_mask": {
          "i": "0"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/strided_slice_1",
      "op": "StridedSlice",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1"],
      "attr": {
        "shrink_axis_mask": {
          "i": "1"
        },
        "begin_mask": {
          "i": "0"
        },
        "ellipsis_mask": {
          "i": "0"
        },
        "new_axis_mask": {
          "i": "0"
        },
        "end_mask": {
          "i": "0"
        },
        "T": {
          "type": "DT_INT32"
        },
        "Index": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/strided_slice_2",
      "op": "StridedSlice",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1"],
      "attr": {
        "ellipsis_mask": {
          "i": "0"
        },
        "begin_mask": {
          "i": "0"
        },
        "new_axis_mask": {
          "i": "0"
        },
        "end_mask": {
          "i": "0"
        },
        "T": {
          "type": "DT_INT32"
        },
        "Index": {
          "type": "DT_INT32"
        },
        "shrink_axis_mask": {
          "i": "1"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/mul",
      "op": "Mul",
      "input": ["StatefulPartitionedCall/model_1/conv2d_transpose_15/mul/y", "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/strided_slice_1"],
      "attr": {
        "T": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/mul_1",
      "op": "Mul",
      "input": ["StatefulPartitionedCall/model_1/conv2d_transpose_15/mul/y", "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/strided_slice_2"],
      "attr": {
        "T": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/stack",
      "op": "Pack",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/strided_slice", "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/mul", "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/mul_1", "StatefulPartitionedCall/model_1/sequential_26/conv2d_transpose_11/stack/3"],
      "attr": {
        "N": {
          "i": "4"
        },
        "T": {
          "type": "DT_INT32"
        },
        "axis": {
          "i": "0"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/conv2d_transpose",
      "op": "Conv2DBackpropInput",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/stack", "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1/sequential_22/leaky_re_lu_15/LeakyRelu"],
      "attr": {
        "data_format": {
          "s": "TkhXQw=="
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        },
        "padding": {
          "s": "U0FNRQ=="
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3/Mul",
      "op": "Mul",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_1/sequential_23/conv2d_transpose_8/conv2d_transpose"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3",
      "op": "Add",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3/Offset"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_23/re_lu_7/Relu",
      "op": "Relu",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/batch_normalization_21/FusedBatchNormV3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/concatenate_7/concat",
      "op": "ConcatV2",
      "input": ["StatefulPartitionedCall/model_1/sequential_23/re_lu_7/Relu", "StatefulPartitionedCall/model_1/sequential_21/leaky_re_lu_14/LeakyRelu", "StatefulPartitionedCall/model_1/conv2d_transpose_15/stack/3"],
      "attr": {
        "Tidx": {
          "type": "DT_INT32"
        },
        "T": {
          "type": "DT_FLOAT"
        },
        "N": {
          "i": "2"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/Shape",
      "op": "Shape",
      "input": ["StatefulPartitionedCall/model_1/concatenate_7/concat"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "out_type": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/strided_slice",
      "op": "StridedSlice",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1"],
      "attr": {
        "end_mask": {
          "i": "0"
        },
        "Index": {
          "type": "DT_INT32"
        },
        "T": {
          "type": "DT_INT32"
        },
        "shrink_axis_mask": {
          "i": "1"
        },
        "ellipsis_mask": {
          "i": "0"
        },
        "begin_mask": {
          "i": "0"
        },
        "new_axis_mask": {
          "i": "0"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/strided_slice_1",
      "op": "StridedSlice",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1"],
      "attr": {
        "Index": {
          "type": "DT_INT32"
        },
        "T": {
          "type": "DT_INT32"
        },
        "shrink_axis_mask": {
          "i": "1"
        },
        "begin_mask": {
          "i": "0"
        },
        "ellipsis_mask": {
          "i": "0"
        },
        "new_axis_mask": {
          "i": "0"
        },
        "end_mask": {
          "i": "0"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/strided_slice_2",
      "op": "StridedSlice",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose_15/strided_slice/stack_1"],
      "attr": {
        "shrink_axis_mask": {
          "i": "1"
        },
        "ellipsis_mask": {
          "i": "0"
        },
        "begin_mask": {
          "i": "0"
        },
        "new_axis_mask": {
          "i": "0"
        },
        "end_mask": {
          "i": "0"
        },
        "Index": {
          "type": "DT_INT32"
        },
        "T": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/mul",
      "op": "Mul",
      "input": ["StatefulPartitionedCall/model_1/conv2d_transpose_15/mul/y", "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/strided_slice_1"],
      "attr": {
        "T": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/mul_1",
      "op": "Mul",
      "input": ["StatefulPartitionedCall/model_1/conv2d_transpose_15/mul/y", "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/strided_slice_2"],
      "attr": {
        "T": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/stack",
      "op": "Pack",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/strided_slice", "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/mul", "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/mul_1", "StatefulPartitionedCall/model_1/sequential_26/conv2d_transpose_11/stack/3"],
      "attr": {
        "T": {
          "type": "DT_INT32"
        },
        "axis": {
          "i": "0"
        },
        "N": {
          "i": "4"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/conv2d_transpose",
      "op": "Conv2DBackpropInput",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/stack", "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1/concatenate_7/concat"],
      "attr": {
        "padding": {
          "s": "U0FNRQ=="
        },
        "dilations": {
          "list": {
            "i": ["1", "1", "1", "1"]
          }
        },
        "T": {
          "type": "DT_FLOAT"
        },
        "data_format": {
          "s": "TkhXQw=="
        },
        "strides": {
          "list": {
            "i": ["1", "2", "2", "1"]
          }
        },
        "explicit_paddings": {
          "list": {}
        },
        "use_cudnn_on_gpu": {
          "b": true
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3/Mul",
      "op": "Mul",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_1/sequential_24/conv2d_transpose_9/conv2d_transpose"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3",
      "op": "Add",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3/Offset"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_24/re_lu_8/Relu",
      "op": "Relu",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/batch_normalization_22/FusedBatchNormV3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/concatenate_8/concat",
      "op": "ConcatV2",
      "input": ["StatefulPartitionedCall/model_1/sequential_24/re_lu_8/Relu", "StatefulPartitionedCall/model_1/sequential_20/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_1/conv2d_transpose_15/stack/3"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "N": {
          "i": "2"
        },
        "Tidx": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "StatefulPartitionedCall/model_1/sequential_25/conv2d_transpose_10/Shape",
      "op": "Shape",
      "input": ["StatefulPartitionedCall/model_1/concatenate_8/concat"],
      "attr": {
        "T": {
          "type": "DT_FLOAT"
        },
        "out_type": {
